{
  "general": {
    "dismiss": "Dismiss",
    "created": "created",
    "updated": "updated",
    "deleted": "deleted",
    "ringing": "ringing",
    "back": "Back to Home"
  },
  "legal_docs": {
    "home_title": "ProjectNocturne - Home",
    "terms_content": "This is the content of your terms and conditions. You can replace it with your actual text.",
    "cookies_title": "Cookies Policy",
    "cookies_content": "This is the content of your cookies policy. You can replace it with your actual text.",
    "privacy_title": "ProjectNocturne Privacy Policy",
    "privacy_last_updated": "Last Updated and Effective Date:",
    "privacy_intro_title": "1. Introduction and Privacy Philosophy",
    "privacy_intro_p1": "We extend a warm welcome to ProjectNocturne (hereinafter, \"the Platform\" or \"the Service\"). Our main goal is to offer an ecosystem of high-productivity digital tools, designed to be powerful, intuitive, and deeply customizable. We understand that the relationship with our users is built on trust, and therefore, our commitment to the protection, security, and transparency in data processing is a fundamental and non-negotiable pillar of our operation.",
    "privacy_intro_p2": "<strong>Acceptance of the Policy:</strong> By using this website, you declare that you have read, understood, and accepted the terms and conditions set forth in this Privacy Policy. If you do not agree with any of the points set out here, we ask you to refrain from using our services.",
    "privacy_intro_p3": "This Privacy Policy has been designed to be a comprehensive and accessible document. Its objective is to provide a clear and unambiguous view of each category of data we collect, the specific and legitimate purposes for which they are processed, the underlying technologies that facilitate the provision of our services and, crucially, the inalienable rights that you, as the owner of your data, possess and can exercise. The continued use and interaction with the Platform imply the reading, understanding, and acceptance of the operational practices described herein.",
    "privacy_definitions_title": "2. Key Definitions",
    "privacy_definitions_intro": "To ensure a clear and precise understanding of this document, it is essential to establish the following definitions that will be used throughout this policy:",
    "privacy_def_personal_data": "<strong>Personal Data:</strong> Refers to any piece of information that, either by itself or in combination with other available data, allows for the direct or indirect identification of a natural person. In the specific context of ProjectNocturne, and in strict application of the principle of minimization, the only personal data we might process is your <strong>email address</strong>, and this only occurs when you decide to provide it voluntarily through our contact or suggestion forms.",
    "privacy_def_usage_telemetry": "<strong>Usage and Telemetry Data:</strong> Corresponds to all information that is automatically generated and collected during your interaction with the Platform. It is important to note that this data is anonymous and not linked to your personal identity. It includes, among others, the <strong>anonymous session identifier (UUID)</strong> to distinguish usage sessions without identifying the user, <strong>interaction events</strong> (such as clicks on specific functions) for usability analysis, and <strong>technical metadata</strong> such as browser type, operating system, and country of origin, in order to optimize compatibility and performance.",
    "privacy_def_user": "<strong>User:</strong> Is any natural person who, freely and voluntarily, accesses, navigates, or uses any of the tools and functionalities offered by the ProjectNocturne Platform through its web domain.",
    "privacy_def_controller": "<strong>Data Controller:</strong> Is the entity that, alone or jointly with others, makes the fundamental decisions about the processing of personal data, including the determination of the purposes (the \"why\") and the means (the \"how\"). For all legal and practical purposes, <strong>ProjectNocturne</strong> is the sole and final Data Controller for the data covered by this policy.",
    "privacy_controller_role_title": "3. Identification and Role of the Data Controller",
    "privacy_controller_role_p1": "Within the framework of the applicable data protection legislation, both nationally and internationally, the \"Data Controller\" is defined as the natural or legal person who, alone or jointly with others, determines the purposes and means of the processing of personal data.",
    "privacy_controller_role_p2": "For all legal and transparency purposes, it is established that <strong>ProjectNocturne</strong>, as a digital entity accessible through its official web domain, acts as the sole and final Data Controller for all personal data and usage data that are collected and processed through user interactions with the Platform.",
    "privacy_controller_role_p3": "This responsibility implies a duty of active diligence that ranges from defining privacy policies and implementing security measures, to guaranteeing the effective exercise of users' rights. As the Data Controller, ProjectNocturne undertakes to ensure that the entire data lifecycle—from collection to eventual deletion—is managed in accordance with the principles of lawfulness, fairness, transparency, minimization, and confidentiality established herein. Any inquiry about the processing of your data should be directed to the contact channels specified in this document.",
    "privacy_principles_title": "4. Guiding Principles of Data Processing",
    "privacy_principles_intro": "Our commitment to your privacy is absolute. Therefore, all our data processing activities are governed by the following fundamental principles, which constitute the pillar of our ethical and operational framework, ensuring that information is handled fairly, transparently, and in line with international best practices:",
    "privacy_principles_lft": "<strong>Lawfulness, Fairness, and Transparency:</strong> All data processing we carry out is based on a solid and clearly defined legal basis in this policy. We act with the utmost fairness towards our users, which means we will never process your data in ways you would not reasonably expect. Transparency is key: we inform you clearly and accessibly about what data we collect and what we use it for.",
    "privacy_principles_purpose": "<strong>Purpose Limitation:</strong> The data we collect is used solely and exclusively for the explicit and legitimate purposes detailed in section 6 of this policy. We are committed to not processing your data for further purposes that are incompatible with those for which it was initially collected, thus ensuring that the information is used in a predictable and respectful manner.",
    "privacy_principles_minimization": "<strong>Data Minimization:</strong> We adopt a \"privacy by design and by default\" approach. This means we only collect the minimum amount of information that is strictly necessary, adequate, and relevant to fulfill each specific purpose. We do not request or collect data that is not essential for the operation and improvement of the Platform.",
    "privacy_principles_security": "<strong>Integrity and Confidentiality:</strong> The security of your data is a critical priority. We implement and maintain a robust set of technical and organizational security measures, such as communication encryption and strict access controls, to protect all information against unauthorized or unlawful processing, as well as against its accidental loss, destruction, or damage.",
    "privacy_data_types_title": "5. Types of Data Collected and Collection Channels",
    "privacy_data_types_intro": "The functionality of the Platform requires the collection of different categories of data, which are broken down below for your full awareness:",
    "privacy_data_types_local_title": "<strong>5.1. Essential Functionality Data (Local Browser Storage):</strong>",
    "privacy_data_types_local_p1": "For ProjectNocturne to be a truly useful and personalized tool, we rely on your browser's local storage technologies (`localStorage` and `IndexedDB`). This decentralized approach gives you, the user, direct and sovereign control over your configuration data. Locally stored information includes:",
    "privacy_data_types_local_li1": "<strong>Tool Configuration (localStorage):</strong> We persistently store the configuration of each alarm, timer, and world clock you create. This includes titles, times, selected sounds, and operational states.",
    "privacy_data_types_local_li2": "<strong>Interface Preferences (localStorage):</strong> We save your customization choices, such as the visual theme (light/dark), text color, and font scale, so that the interface adapts to your liking on each visit.",
    "privacy_data_types_local_li3": "<strong>Custom Audio Files (IndexedDB):</strong> If you use the feature to upload your own sounds for alerts, these files are saved in your browser's `IndexedDB` database. This is local and private storage on your machine; these files are never transferred to our servers.",
    "privacy_data_types_user_title": "<strong>5.2. Data Provided Directly by the User:</strong>",
    "privacy_data_types_user_li1": "<strong>Suggestions and Improvements Form:</strong> When you contact us through the suggestions form, we collect the data you voluntarily provide: your <strong>email address</strong>, the <strong>category of your feedback</strong>, and the <strong>content of your message</strong>.",
    "privacy_data_types_telemetry_title": "<strong>5.3. Anonymous Usage and Telemetry Data:</strong>",
    "privacy_data_types_telemetry_p1": "To improve the Platform, we collect usage data anonymously, which does not allow for your personal identification:",
    "privacy_data_types_telemetry_li1": "<strong>Unique Session Identifier (UUID):</strong> We assign an anonymous identifier to your browser (`user-unique-id`) to group usage metrics without collecting personal information.",
    "privacy_data_types_telemetry_li2": "<strong>Event Telemetry:</strong> We record key anonymous interactions with the platform's functionalities. This data is crucial for our usability analysis and for understanding which tools are most valued by our users.",
    "privacy_data_types_telemetry_li3": "<strong>Technical and Geographic Data:</strong> We detect your <strong>country</strong> of origin (without storing your IP), <strong>operating system</strong>, and <strong>web browser</strong> to optimize compatibility and experience.",
    "privacy_purposes_title": "6. Detailed Purposes of Data Processing",
    "privacy_purposes_intro": "The processing of each data category pursues clear, defined, and legitimate objectives, aimed exclusively at the provision and continuous improvement of our services. These purposes are detailed below:",
    "privacy_purposes_op": "<strong>For the Operation and Maintenance of the Service:</strong> The local storage of your settings and preferences is fundamental to the core functionality of the Platform. Without this capability, your custom alarms, timers, world clocks, and design preferences (theme, color, font) would be lost every time you close or refresh the page. This purpose is, therefore, essential to offer you a consistent, persistent, and truly personalized user experience, which is the core of our value proposition.",
    "privacy_purposes_imp": "<strong>For Continuous Improvement and Strategic Analysis:</strong> The collection of telemetry and anonymous usage data is a vital tool for the evolution of ProjectNocturne. This aggregated data allows us to understand how users interact with different tools, which functions are most used, and where points of friction or difficulty may exist. This quantitative analysis guides our development decisions, helps us prioritize new features, optimize existing workflows, and ensure our resources are invested in the areas that provide the most value to our user community.",
    "privacy_purposes_comms": "<strong>For Managing Communications and User Support:</strong> When you send us your comments, suggestions, or bug reports through the contact form, we use the information provided (your email and the content of your message) for the sole purpose of managing that communication. This includes processing your request, investigating the reported issue, answering your questions, and generally providing the support you need. We will not use your email for unsolicited marketing purposes.",
    "privacy_purposes_ux": "<strong>For Personalizing the User Experience:</strong> Beyond the settings you actively save, the Platform performs an initial detection of factors such as your browser's language and your operating system's theme preferences. This information is used to automatically configure the interface to an initial state that is familiar and comfortable for you from the very first moment, reducing the need for manual adjustments and making the Platform feel more intuitive and adapted to your digital environment.",
    "privacy_legal_basis_title": "7. Legal Basis for Processing",
    "privacy_legal_basis_intro": "All data processing we carry out at ProjectNocturne is supported by a solid and transparent legal basis, in accordance with major data protection regulations such as the General Data Protection Regulation (GDPR) of the European Union. The legal bases that legitimize our processing activities are as follows:",
    "privacy_legal_basis_consent": "<strong>Your Explicit Consent:</strong> For certain processing activities, our legitimacy is based on the free, specific, informed, and unambiguous consent you give us. This is the case when you voluntarily decide to use our suggestion form and provide us with your email address so we can reply to you. Likewise, by accepting our cookie and privacy policy when using the service, you are consenting to the practices described herein. You have the right to withdraw your consent at any time, without affecting the lawfulness of the processing based on consent before its withdrawal.",
    "privacy_legal_basis_interest": "<strong>Our Legitimate Interest:</strong> For other activities, the legal basis is our legitimate interest as a company to operate and improve our service. This applies specifically to the collection of anonymous usage and telemetry data. Our legitimate interest consists of understanding how our Platform is used so we can improve it, fix bugs, and make strategic decisions about its future development. We have conducted a balancing test to ensure that this interest does not override your fundamental rights and freedoms, especially since the data is processed anonymously and does not allow for your personal identification.",
    "privacy_retention_title": "8. Data Retention and Deletion Policy",
    "privacy_retention_intro": "At ProjectNocturne, we apply a differentiated and transparent data retention policy, designed to give you maximum control over your information and to ensure that we do not store data longer than is strictly necessary.",
    "privacy_retention_local": "<strong>Local Data (`localStorage` and `IndexedDB`):</strong> This category of data, which includes all your tool settings and interface preferences, resides exclusively on your device, within your web browser's secure storage. <strong>You have full and absolute control over this data.</strong> It remains on your device indefinitely to ensure the persistence of your personalized experience every time you visit the Platform. The deletion of this data is entirely in your hands and can be done at any time through the Browse data cleaning tools offered by your browser (such as \"Clear Browse data\", \"Clear history\", or similar).",
    "privacy_retention_server": "<strong>Server Data (Suggestions and Telemetry):</strong> Information transmitted to our servers, such as data from your suggestion form (including your email) and anonymous usage telemetry, follows a defined lifecycle. This data is retained only for the period essential to fulfill the purpose for which it was collected. For example, we will keep the details of a suggestion until it has been processed and answered. Once the purpose has been fulfilled, or if any applicable legal period expires, the data is securely and permanently deleted from our systems.",
    "privacy_rights_title": "9. User Rights and Exercise Mechanisms",
    "privacy_rights_intro": "At ProjectNocturne, we not only recognize but fully guarantee your rights over your personal data, in line with the highest data protection standards. You have control and can exercise the following rights at any time:",
    "privacy_rights_access": "<strong>Right of Access:</strong> You have the right to obtain confirmation as to whether or not personal data concerning you is being processed by ProjectNocturne and, if so, access to that data. This includes the right to know the purposes of the processing, the categories of data concerned, and the recipients of the data. Since the only personal data we store on the server is your email address (if you contact us), you can request confirmation of its existence and a copy of it.",
    "privacy_rights_rectification": "<strong>Right to Rectification:</strong> If you believe that the personal data we may hold about you (such as your email address in the context of a communication) is inaccurate or incomplete, you have the right to request its correction without undue delay.",
    "privacy_rights_erasure": "<strong>Right to Erasure ('Right to be Forgotten'):</strong> You have the right to request the deletion of your personal data. This applies both to data stored locally in your browser (which you can delete directly through your browser's cleaning options) and to data we may have on our servers (such as your email after an inquiry). Upon receiving your request, we will proceed with the secure deletion of your information, provided there is no legal obligation preventing us from doing so.",
    "privacy_rights_objection": "<strong>Right to Restrict and Object to Processing:</strong> In certain circumstances, you have the right to request the restriction of the processing of your data or to object to such processing. For example, you can object to your data (email address) being further processed after a query has been resolved. We will respect your request and cease processing, except for compelling legitimate grounds or for the establishment, exercise, or defense of legal claims.",
    "privacy_security_title": "10. Implemented Security Measures",
    "privacy_security_intro": "The protection and integrity of the information you entrust to us, as well as the usage data we process, are a top priority for ProjectNocturne. We understand the responsibility this entails and, consequently, we have implemented a multi-layered security framework, adopting robust technical and organizational measures designed to mitigate the risks of unauthorized access, alteration, disclosure, or accidental or unlawful destruction of data.",
    "privacy_security_p1": "Our security strategy covers the following key areas:",
    "privacy_security_li1": "<strong>Data Transmission Security:</strong> All communication between your browser and our servers, especially that involving the transmission of sensitive data like from the suggestion form, is conducted over secure channels using industry-standard encryption protocols (such as TLS/SSL). This ensures that information travels across the network confidentially and with integrity.",
    "privacy_security_li2": "<strong>Storage Security:</strong> Data hosted on our server infrastructure, such as anonymous telemetry and suggestions, is stored in databases with strict access controls. Access to these databases is exclusively limited to authorized personnel who need to know the information for the performance of their duties, following the principle of least privilege.",
    "privacy_security_li3": "<strong>Application-Level Security:</strong> Our platform is developed following best practices for secure coding to prevent common vulnerabilities. We conduct regular reviews of our code and dependencies to identify and mitigate potential security breaches.",
    "privacy_security_li4": "<strong>Operational Security:</strong> We have internal information security management policies that govern the access, handling, and protection of data. Personnel with access to systems are aware of their obligations regarding confidentiality and security.",
    "privacy_security_p2": "Despite our commitment and diligence in applying these measures, it is important to recognize that no Internet transmission or electronic storage system is infallible or 100% invulnerable. However, we are committed to continuously maintaining and improving our security practices to adapt to new threats and protect your data with the utmost rigor.",
    "privacy_updates_title": "11. Modifications and Updates to the Privacy Policy",
    "privacy_updates_p1": "The digital environment, technologies, and, very relevantly, regulations on privacy and data protection, are in a constant state of evolution. To ensure that our practices not only comply with current regulations but also remain aligned with the highest standards of protection and transparency, ProjectNocturne reserves the right to modify, amend, or update this Privacy Policy at any time and at its sole discretion.",
    "privacy_updates_p2": "Any modification made will be effective immediately upon its publication on this same page. We are committed to ensuring that each version of the policy clearly and visibly indicates the \"Last Updated\" date at the top of the document. This mechanism will allow you to easily identify if there have been changes since your last review, fostering a transparent relationship.",
    "privacy_updates_p3": "We strongly encourage you to review this page periodically to stay informed about how we protect your information. Your continued use of the Platform after the publication of such modifications will constitute your acknowledgment and acceptance of the revised policy. In the event of substantial changes that could significantly affect your rights or the way we process your information, we will endeavor to use additional or more direct notification methods, where possible and proportionate, to ensure you are duly informed.",
    "privacy_contact_title": "12. Contact and Ways to Exercise Rights",
    "privacy_contact_p1": "Your opinion is fundamental to us, and open communication is a pillar of our service philosophy. We are at your complete disposal to resolve any questions, concerns, or requests for information that may arise in relation to this Privacy Policy, our data processing practices, or any other aspect related to your privacy on our Platform.",
    "privacy_contact_p2": "If you wish to exercise any of your rights of Access, Rectification, Erasure, or Objection, or if you simply want to get more clarification on any point, we invite you to use our official communication channel. You can contact our team through the <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">feedback form</a></strong> available directly on the Platform.",
    "privacy_contact_p3": "We are committed to acknowledging receipt of your communication, managing your request with due diligence and professionalism, and responding to you within the legally established deadlines, providing all the necessary assistance to ensure that you have effective and transparent control over your information.",
    "terms_title": "ProjectNocturne Terms and Conditions of Use",
    "terms_last_updated": "Last Updated:",
    "terms_intro_title": "1. Acceptance and Scope of Terms",
    "terms_intro_p1": "These Terms and Conditions ('Terms') constitute a <strong>legally binding agreement</strong> between you ('User', 'you') and the owner and operator of ProjectNocturne ('we', 'us', 'our'). These Terms govern your access to and use of the ProjectNocturne web application, including all its tools, features, content, and services (collectively, the 'Service'). By accessing, Browse, or using the Service in any manner, you confirm that you have read, understood, and <strong>agree to be legally bound</strong> by these Terms and our Privacy Policy, which is incorporated herein by reference. If you do not agree to all of these Terms, you must <strong>immediately cease all use</strong> of the Service.",
    "terms_intro_p2": "We reserve the <strong>exclusive right</strong>, at our <strong>sole discretion</strong>, to modify, add, or remove portions of these Terms at any time without prior notice. It is your responsibility to review these Terms periodically. Your continued use of the Service following the posting of changes will constitute your <strong>binding acceptance</strong> of such changes.",
    "terms_service_desc_title": "2. Description and Nature of the Service",
    "terms_service_desc_p1": "ProjectNocturne is a web application that provides a suite of productivity and time management tools. The Service is designed as a personal utility and is offered on an <strong>'AS IS'</strong> and <strong>'AS AVAILABLE'</strong> basis.",
    "terms_service_desc_p2": "You expressly acknowledge and agree that the operation of the Service, particularly its notification features, depends on <strong>external factors beyond our control</strong>. These factors include, but are not limited to, the stability of your internet connection, the version and configuration of your web browser, the notification permissions you grant, and the power management and background process policies of your operating system. We <strong>do not guarantee</strong> the timely delivery or execution of any notification or alert.",
    "terms_service_desc_p3": "All tool configurations and interface customizations are stored <strong>locally in your browser</strong>. You are <strong>solely and fully responsible</strong> for the management of this data. Any action that results in clearing your browser's cache or site data will lead to the <strong>permanent and irretrievable loss</strong> of all your settings. We <strong>do not have access to or control</strong> over this local data.",
    "terms_user_responsibilities_title": "3. Fundamental User Obligations and Responsibilities",
    "terms_user_responsibilities_intro": "By using the Service, you assume <strong>full responsibility</strong> for your actions and for how you use the provided tools. You agree to:",
    "terms_user_resp_li1": "<strong>Appropriate and Non-Critical Use:</strong> Use the Service responsibly. You explicitly understand and agree that ProjectNocturne is a convenience tool and <strong>under no circumstances</strong> should it be used or relied upon for <strong>critical, professional, emergency, medical, or commercial</strong> situations where a failure, delay, or inaccuracy could result in serious harm. The <strong>reliability of the features is not guaranteed</strong>.",
    "terms_user_resp_li2": "<strong>Uploaded Content and Copyright:</strong> If you use the feature to upload custom audio files ('User Content'), you <strong>affirm, represent, and warrant</strong> that: (i) you are the <strong>sole creator and owner</strong> of such content, or you possess all <strong>necessary rights, licenses, and permissions</strong>; and that (ii) your content <strong>does not infringe on third-party rights</strong>. You are <strong>solely and exclusively responsible</strong> for your User Content. If we receive a copyright infringement notice, we are committed to <strong>cooperating with the corresponding legal procedures</strong>.",
    "terms_user_resp_li3": "<strong>Security of Your Own Environment:</strong> Ensure that your system (device, OS, and browser) is <strong>properly configured</strong> to allow the Service to function, including notification permissions. It is your responsibility to ensure your security software does not interfere with the Service.",
    "terms_user_resp_li4": "<strong>Local Data Management:</strong> Acknowledge and accept that the loss of your personal settings due to actions on your own device is your <strong>exclusive responsibility</strong> and cannot be attributed to a failure of the Service.",
    "terms_prohibited_conduct_title": "4. Specifically Prohibited Conduct",
    "terms_prohibited_conduct_intro": "Your permission to use the Service is conditioned upon your strict compliance with the rules of conduct. The following activities are <strong>strictly prohibited</strong>:",
    "terms_prohibited_li1": "<strong>Reverse Engineering:</strong> To reverse engineer, decompile, disassemble, or otherwise attempt to discover the <strong>source code or algorithms</strong> of the Service.",
    "terms_prohibited_li2": "<strong>Use of Automated Systems:</strong> To use any automated system, such as <strong>'robots' or 'spiders'</strong>, to access, monitor, or interact with the Service in a way that imposes an <strong>unreasonable load</strong> on our infrastructure.",
    "terms_prohibited_li3": "<strong>Uploading Malicious Content:</strong> To upload or transmit any audio file containing <strong>viruses, worms, trojans</strong>, or any other malicious code.",
    "terms_prohibited_li4": "<strong>Service Interference:</strong> To actively attempt to interfere with the proper working of the Service or compromise the <strong>integrity or security</strong> of our system.",
    "terms_prohibited_li5": "<strong>Abuse of Communication Channels:</strong> To use the contact form to send <strong>spam, unsolicited messages</strong>, or any form of abusive communication.",
    "terms_prohibited_li6": "<strong>General Illegal Use:</strong> To use the Service for any purpose that violates local, state, national, or international laws.",
    "terms_ip_title": "5. Intellectual Property",
    "terms_ip_p1": "The Service, including its source code, design, 'look and feel', and all of our generated content (the 'ProjectNocturne Content'), are the <strong>exclusive property</strong> of ProjectNocturne and are protected by <strong>copyright and trade secret laws</strong> internationally.",
    "terms_ip_p2": "We grant you a <strong>limited, personal, non-exclusive, non-transferable, and revocable license</strong> to access and use the Service strictly for your personal, functional use. This license grants you <strong>no ownership rights</strong>.",
    "terms_ip_p3": "Any use of the Service or the ProjectNocturne Content not authorized herein is <strong>strictly prohibited</strong> and will result in the immediate termination of the license granted.",
    "terms_disclaimers_title": "6. DISCLAIMER OF WARRANTIES",
    "terms_disclaimers_p1": "YOU EXPRESSLY UNDERSTAND AND AGREE THAT YOUR USE OF THE SERVICE IS <strong>AT YOUR SOLE RISK</strong>. THE SERVICE IS PROVIDED ON AN <strong>'AS IS' AND 'AS AVAILABLE'</strong> BASIS. PROJECTNOCTURNE EXPRESSLY DISCLAIMS <strong>ALL WARRANTIES</strong> OF ANY KIND, WHETHER EXPRESS OR IMPLIED.",
    "terms_disclaimers_p2": "<strong>WE DO NOT WARRANT</strong> THAT THE SERVICE WILL BE UNINTERRUPTED, TIMELY, SECURE, OR ERROR-FREE. WE DO NOT GUARANTEE THAT ALERTS OR NOTIFICATIONS WILL FUNCTION CORRECTLY AT ALL TIMES. SERVICE FUNCTIONALITY MAY BE ADVERSELY AFFECTED BY CONDITIONS BEYOND OUR CONTROL.",
    "terms_disclaimers_p3": "<strong>WE DO NOT WARRANT</strong> THAT THE RESULTS THAT MAY BE OBTAINED FROM THE USE OF THE SERVICE, SUCH AS THE ACCURACY OF ITS TIME-RELATED FEATURES, WILL BE <strong>ACCURATE OR RELIABLE</strong>.",
    "terms_liability_title": "7. LIMITATION OF LIABILITY",
    "terms_liability_p1": "TO THE <strong>FULLEST EXTENT PERMITTED BY APPLICABLE LAW</strong>, IN NO EVENT SHALL PROJECTNOCTURNE, ITS AFFILIATES, DIRECTORS, EMPLOYEES, AGENTS, OR LICENSORS BE LIABLE FOR ANY <strong>INDIRECT, PUNITIVE, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR EXEMPLARY DAMAGES</strong>.",
    "terms_liability_p2": "UNDER <strong>NO CIRCUMSTANCES</strong> WILL WE BE RESPONSIBLE FOR ANY DAMAGE, LOSS, OR INJURY RESULTING FROM HACKING, TAMPERING, OR OTHER UNAUTHORIZED ACCESS OR USE OF THE SERVICE.",
    "terms_indemnification_title": "8. Indemnification",
    "terms_indemnification_p1": "You agree to <strong>defend, indemnify, and hold harmless</strong> ProjectNocturne from and against any and all claims, damages, obligations, losses, and expenses (including attorney's fees) arising from: (i) your use of the Service; (ii) your <strong>violation of any term</strong> of these Terms; or (iii) your <strong>violation of any third-party right</strong>, especially in relation to your User Content.",
    "terms_termination_title": "9. Termination and Suspension of Access",
    "terms_termination_intro": "We reserve the right to terminate or suspend your access to the Service for various reasons, to protect the integrity and security of the platform. Termination may occur at our sole discretion, with or without notice. Causes for termination include, but are not limited to:",
    "terms_termination_li1": "<strong>Material Breach of Terms:</strong> If you breach any of the provisions set forth in these Terms, especially those relating to Prohibited Conduct (Section 4).",
    "terms_termination_li2": "<strong>Illegal or Fraudulent Activity:</strong> If we have reasonable grounds to suspect that you have used the Service for any illegal, fraudulent, or malicious purpose.",
    "terms_termination_li3": "<strong>Risk to the Service or Third Parties:</strong> If your use of the Service, in our sole discretion, poses a technical, security, or reputational risk to ProjectNocturne or its users.",
    "terms_termination_p1": "We may exercise our right to <strong>terminate or suspend your access</strong> immediately, <strong>without prior notice or liability</strong>. The determination of what constitutes a reason for termination rests solely with us.",
    "terms_termination_p2": "Upon termination, your right to use the Service will <strong>immediately cease</strong>. All provisions of the Terms which by their nature should survive termination, <strong>shall survive</strong>, including, without limitation, ownership provisions, warranty disclaimers, indemnity, and limitations of liability.",
    "terms_governing_law_title": "10. Governing Law, Jurisdiction, and Dispute Resolution",
    "terms_governing_law_p1": "These Terms shall be governed and construed in accordance with the <strong>laws of the jurisdiction</strong> in which the owner of ProjectNocturne is domiciled. You agree to submit to the <strong>personal and exclusive jurisdiction</strong> of the courts located within that jurisdiction.",
    "terms_governing_law_p2": "Before filing a formal legal action, you agree to try to resolve any dispute with us <strong>informally</strong>. If a dispute is not resolved within <strong>sixty (60) days</strong> of submission, either party may begin formal proceedings.",
    "terms_governing_law_p3": "TO THE FULLEST EXTENT PERMITTED BY LAW, YOU AND PROJECTNOCTURNE AGREE TO BRING CLAIMS AGAINST THE OTHER ONLY IN YOUR OR ITS <strong>INDIVIDUAL CAPACITY</strong>, AND NOT AS A PLAINTIFF OR CLASS MEMBER IN ANY PURPORTED <strong>CLASS ACTION</strong>. Further, any claim must be filed within <strong>one (1) year</strong> after such claim arose, or it is forever barred.",
    "terms_general_title": "11. General Provisions",
    "terms_general_p1": "<strong>Entire Agreement:</strong> These Terms, together with the Privacy Policy, constitute the entire and exclusive agreement between you and ProjectNocturne regarding the Service, and supersede all prior agreements.",
    "terms_general_p2": "<strong>Severability:</strong> If any provision of these Terms is held to be invalid or unenforceable by a court, the remaining provisions of these Terms will remain in effect.",
    "terms_general_p3": "<strong>No Waiver:</strong> Our failure to enforce any right or provision of these Terms will not be considered a waiver of those rights.",
    "terms_general_p4": "<strong>Assignment:</strong> You may not assign or transfer these Terms without our prior written consent. We may freely assign or transfer these Terms without restriction.",
    "terms_contact_title": "12. Contact and Reporting",
    "terms_contact_p1": "For any general questions, bug reports, or concerns regarding these Terms, the official and preferred communication channel is our <strong><a href=\"#\" data-action=\"submit-feedback\" class=\"legal-link\">Feedback Form</a></strong> available directly on the Platform. We will make a reasonable effort to respond to your inquiries in a timely manner. Please note that this channel should not be used for formal legal notices."
  },
  "notifications": {
    "alarm_ringing_title": "Alarm Ringing",
    "alarm_created_title": "Alarm Created",
    "alarm_updated_title": "Alarm Updated",
    "alarm_deleted_title": "Alarm Deleted",
    "timer_ringing_title": "Timer Ringing",
    "timer_created_title": "Timer Created",
    "timer_updated_title": "Timer Updated",
    "timer_deleted_title": "Timer Deleted",
    "worldclock_created_title": "Clock Added",
    "worldclock_updated_title": "Clock Updated",
    "worldclock_deleted_title": "Clock Deleted",
    "info_title": "Information",
    "error_title": "Error",
    "premium_title": "Premium Feature",
    "limit_reached_title": "Maximum limit reached",
    "premium_required_title": "Premium Required",
    "alarm_ringing": "The time for '{title}' is up.",
    "alarm_created": "The alarm '{title}' has been set correctly.",
    "alarm_updated": "The alarm '{title}' has been updated correctly.",
    "alarm_deleted": "The alarm '{title}' has been deleted.",
    "timer_ringing": "The time for '{title}' is up.",
    "timer_created": "The timer '{title}' has been started correctly.",
    "timer_updated": "The timer '{title}' has been updated correctly.",
    "timer_deleted": "The timer '{title}' has been deleted.",
    "worldclock_created": "The clock '{title}' has been added correctly.",
    "worldclock_updated": "The clock '{title}' has been updated correctly.",
    "worldclock_deleted": "The clock '{title}' has been deleted.",
    "loading_countries_error": "Error loading countries list.",
    "premium_limit_reached_message": "Become premium to increase the available limit",
    "limit_reached_message_premium": "The maximum limit of available {type} has been reached.",
    "dismiss": "Dismiss",
    "success_title": "Success",
    "feedback_success_sent": "Feedback sent successfully! Thank you for your comments.",
    "feedback_error_all_fields": "Please complete all fields.",
    "feedback_error_invalid_email": "Please enter a valid email address.",
    "feedback_error_server": "Server error, please try again later.",
    "feedback_error_sending": "Error sending feedback, please try again later."
  },
  "color_system": {
    "color_unavailable": "Not available",
    "default_colors": "Default Colors",
    "gradient_colors": "Gradient Colors",
    "main_colors": "Main Colors",
    "no_recent_colors": "No recent colors",
    "recent_colors": "Recent Colors"
  },
  "colors": {
    "aqua_blue": "Aqua Blue",
    "base_amber": "Amber",
    "base_aqua": "Aqua",
    "base_aquamarine": "Aquamarine",
    "base_beige": "Beige",
    "base_black": "Black",
    "base_blue": "Blue",
    "base_brown": "Brown",
    "base_cerulean": "Cerulean",
    "base_chartreuse": "Chartreuse",
    "base_coral": "Coral",
    "base_cream": "Cream",
    "base_cyan": "Cyan",
    "base_emerald": "Emerald",
    "base_gold": "Gold",
    "base_gray": "Gray",
    "base_green": "Green",
    "base_indigo": "Indigo",
    "base_jade": "Jade",
    "base_lavender": "Lavender",
    "base_lime": "Lime",
    "base_magenta": "Magenta",
    "base_maroon": "Maroon",
    "base_mint": "Mint",
    "base_navy": "Navy",
    "base_olive": "Olive",
    "base_orange": "Orange",
    "base_peach": "Peach",
    "base_pink": "Pink",
    "base_purple": "Purple",
    "base_red": "Red",
    "base_salmon": "Salmon",
    "base_sienna": "Sienna",
    "base_silver": "Silver",
    "base_teal": "Teal",
    "base_turquoise": "Turquoise",
    "base_vermilion": "Vermilion",
    "base_violet": "Violet",
    "base_white": "White",
    "base_yellow": "Yellow",
    "black": "Black",
    "bright_red": "Bright Red",
    "cobalt_blue": "Cobalt Blue",
    "coral_red": "Coral Red",
    "dark_gray": "Dark Gray",
    "dark_turquoise": "Dark Turquoise",
    "grass_green": "Grass Green",
    "green": "Green",
    "lavender_pink": "Lavender Pink",
    "light_gray": "Light Gray",
    "lime_green": "Lime Green",
    "medium_gray": "Medium Gray",
    "orange": "Orange",
    "peach": "Peach",
    "pink": "Pink",
    "purple": "Purple",
    "royal_blue": "Royal Blue",
    "sky_blue": "Sky Blue",
    "turquoise_blue": "Turquoise Blue",
    "very_light_gray": "Very Light Gray",
    "violet": "Violet",
    "white": "White",
    "yellow": "Yellow"
  },
  "menu": {
    "appearance": "Appearance",
    "dark_theme": "Dark Theme",
    "email": "Email",
    "english_us": "English (United States)",
    "french_fr": "Français (France)",
    "language": "Language",
    "light_theme": "Light Theme",
    "privacy_policy": "Privacy Policy",
    "settings": "Settings",
    "spanish_mx": "Español (México)",
    "submit_feedback": "Submit feedback",
    "sync_with_system": "Sync with System",
    "location": "Location",
    "detecting": "Detecting...",
    "none_selected": "None Selected",
    "feedback_title": "Submit Feedback",
    "feedback_desc": "Your feedback helps us improve ProjectNocturne. What would you like to see added or changed?",
    "feedback_type": "Feedback Type",
    "feedback_type_improvement": "Improvement",
    "feedback_type_bug": "Report a Bug",
    "feedback_type_contact_support": "Contact Support",
    "feedback_type_feature": "Feature Request",
    "feedback_type_other": "Other",
    "feedback_message": "Message",
    "write_feedback_message": "Write message",
    "send_feedback": "Send Feedback",
    "help_and_resources": "Help & Resources",
    "whats_new": "What's New",
    "terms_and_conditions": "Terms & Conditions",
    "cookies_policy": "Cookies Policy"
  },
  "search": {
    "no_results": "No results found for",
    "no_valid_results": "No valid results for current theme for",
    "search_error": "Could not process search",
    "search_placeholder": "Try \"red\" or \"#f44336\"",
    "search_alarms_placeholder": "Search alarms...",
    "search_timers_placeholder": "Search timers...",
    "search_clocks_placeholder": "Search clocks...",
    "search_cities_placeholder": "Search countries...",
    "search_countries_placeholder": "Search countries...",
    "search_sounds_placeholder": "Search sounds...",
    "search_timezones_placeholder": "Search timezones..."
  },
  "search_sections": {
    "brightness_dark": "Darker Variations",
    "brightness_light": "Lighter Variations",
    "saturation_less": "Less Saturated",
    "saturation_more": "More Saturated",
    "search_result": "Search Result",
    "shades": "Shades (+ Black)",
    "temperature_cooler": "Cooler Variations",
    "temperature_warmer": "Warmer Variations",
    "tints": "Tints (+ White)",
    "tones": "Tones (+ Gray)"
  },
  "tooltips": {
    "add": "Increase Font Size",
    "add_alarm": "Add Alarm",
    "add_clock": "Add Clock",
    "add_timer": "Add Timer",
    "add_element": "Add element",
    "alarm": "Alarm",
    "alarms": "Alarms",
    "auto": "Automatic Color",
    "bold": "Bold",
    "color": "Text Color",
    "color_separator": ": ",
    "edit": "Edit",
    "everything": "Home",
    "fullscreen": "Fullscreen",
    "italic": "Italic",
    "lap": "Lap",
    "linear_gradient_90deg": "Linear Gradient 90°",
    "menu": "Menu",
    "pause": "Pause",
    "pin_clock": "Pin clock",
    "pin_timer": "Pin timer",
    "play": "Start",
    "remove": "Reduce Font Size",
    "reset": "Reset",
    "settings": "Settings",
    "stop": "Stop",
    "stopwatch": "Stopwatch",
    "timer": "Timer",
    "timezone": "Timezone",
    "world_clock": "World Clock",
    "change_format": "Change format",
    "export_laps": "Export laps"
  },
  "stopwatch": {
    "lap_header": "Lap",
    "time_header": "Time",
    "total_time_header": "Total Time",
    "running": "Running",
    "paused": "Paused"
  },
  "alarms": {
    "alarm_title": "Alarm Title",
    "my_new_alarm_placeholder": "My new alarm",
    "alarm_settings": "Alarm Settings",
    "alarm_sound": "Alarm Sound",
    "create_alarm": "Create alarm",
    "my_alarms": "My alarms",
    "edit_alarm": "Edit Alarm",
    "delete_alarm": "Delete Alarm",
    "test_alarm": "Test Alarm",
    "save_changes": "Save Changes",
    "confirm_delete_alarm": "Are you sure you want to delete this alarm?",
    "alarm_limit_reached": "Alarm limit of {limit} reached.",
    "default_alarms": "Default alarms",
    "activate_alarm": "Activate Alarm",
    "deactivate_alarm": "Deactivate Alarm",
    "dismiss": "Dismiss",
    "clean_room": "Clean room",
    "lunch_time": "Lunch Time",
    "read_book": "Read a book",
    "take_a_break": "Take a break"
  },
  "world_clock": {
    "clock_title": "Clock Title",
    "my_new_clock_placeholder": "My new clock",
    "select_country": "Select a country",
    "select_a_country": "Select a country",
    "select_timezone": "Select a timezone",
    "select_a_timezone": "Select a timezone",
    "country_and_timezone": "Country and Timezone",
    "loading_countries": "Loading countries...",
    "error_loading_countries": "Error loading countries.",
    "no_timezones_found": "No timezones found.",
    "error_loading_timezones": "Error loading timezones.",
    "clock_limit_reached": "Clock limit of {limit} reached."
  },
  "sounds": {
    "classic_beep": "Classic Beep",
    "gentle_chime": "Gentle Chime",
    "digital_alarm": "Digital Alarm",
    "peaceful_tone": "Peaceful Tone",
    "urgent_beep": "Urgent Beep",
    "upload_audio": "Upload Audio",
    "uploaded_audios": "Uploaded Audios",
    "default_audios": "Default Audios",
    "audio_singular": "Audio",
    "select_audio": "Select audio"
  },
  "timer": {
    "h": "h",
    "min": "min",
    "s": "s",
    "countdown": "Countdown",
    "count_to_date": "Count to Date",
    "timer_title": "Timer Title",
    "my_new_timer_placeholder": "My new timer",
    "my_event_placeholder": "My special event",
    "set_duration": "Set Duration",
    "when_timer_ends": "When timer ends",
    "stop_timer": "Stop timer",
    "restart_timer": "Restart timer",
    "start_as_stopwatch": "Start as stopwatch",
    "select_date_time": "Select Date & Time",
    "create_timer": "Create timer",
    "save_changes": "Save Changes",
    "rang_ago": "Rang {time} ago",
    "years": "years",
    "months": "months",
    "days": "days",
    "hours": "Hours",
    "minutes": "Minutes",
    "seconds": "Seconds",
    "edit_timer": "Edit timer",
    "delete_timer": "Delete timer",
    "edit_not_implemented_timer": "Editing for this type of timer is not implemented.",
    "delete_timer_confirm": "Are you sure you want to delete this timer?",
    "event_finished": "Event finished!",
    "timer_limit_reached": "Timer limit of {limit} reached.",
    "my_timers": "My timers",
    "default_timers": "Default timers",
    "timer_options": "Timer options",
    "short_break_5": "Short Break (5 min)",
    "exercise_30": "Exercise (30 min)",
    "study_session_45": "Study Session (45 min)",
    "pinned_timer_tooltip": "Pinned Timer",
    "select_date": "Select Date",
    "select_time": "Select Time"
  },
  "world_clock_options": {
    "options": "Clock options",
    "edit_clock": "Edit clock",
    "delete_clock": "Delete clock",
    "local_time": "Local Time",
    "edit_not_implemented": "Edit clock functionality is pending implementation.",
    "fullscreen_not_implemented": "Fullscreen functionality is pending implementation.",
    "save_changes": "Save Changes"
  },
  "weekdays": {
    "sunday": "Sunday",
    "monday": "Monday",
    "tuesday": "Tuesday",
    "wednesday": "Wednesday",
    "thursday": "Thursday",
    "friday": "Friday",
    "saturday": "Saturday"
  },
  "months": {
    "january": "January",
    "february": "February",
    "march": "March",
    "april": "April",
    "may": "May",
    "june": "June",
    "july": "July",
    "august": "August",
    "september": "September",
    "october": "October",
    "november": "November",
    "december": "December"
  },
  "everything": {
    "main_panel": "Main Panel",
    "local_time": "Local Time",
    "active_alarms": "Active Alarms",
    "running_timers": "Running Timers",
    "world_clocks": "World Clocks",
    "upcoming_events": "Upcoming Events",
    "next_alarm": "Next Alarm",
    "active_timer": "Active Timer",
    "stopwatch": "Stopwatch",
    "quick_actions": "Quick Actions",
    "new_alarm": "New Alarm",
    "new_timer": "New Timer",
    "add_clock": "Add Clock",
    "limit_reached": "Maximum limit reached",
    "no_active_alarms": "No active alarms",
    "no_running_timers": "No running timers",
    "upcoming_festivities": "Upcoming Festivities",
    "new_alarm_desc": "Create and customize a new alarm.",
    "new_timer_desc": "Start a timer or countdown.",
    "add_clock_desc": "Add clocks from other parts of the world.",
    "limit_available": "Limit available ({available} / {limit})"
  },
  "confirmation": {
    "confirm_delete_title_alarm": "Delete Alarm?",
    "confirm_delete_message_alarm": "You are about to delete the alarm {name}. This action cannot be undone.",
    "confirm_delete_title_timer": "Delete Timer?",
    "confirm_delete_message_timer": "You are about to delete the timer {name}. This action cannot be undone.",
    "confirm_delete_title_world-clock": "Delete Clock?",
    "confirm_delete_message_world-clock": "You are about to delete the clock {name}. This action cannot be undone.",
    "confirm_delete_title_audio": "Delete Audio?",
    "confirm_delete_message_audio": "You are about to delete the audio {name}. It will be replaced in any alarms/timers using it. This action cannot be undone.",
    "cancel": "Cancel",
    "delete": "Delete",
    "delete_alarm_title_prefix": "Alarm Title",
    "delete_timer_title_prefix": "Timer Title",
    "delete_world-clock_title_prefix": "Clock Title",
    "delete_audio_title_prefix": "Audio Title"
  }
}